In [1]:
import pandas as pd

In [2]:
# Open up excel into an object
# This takes a long time - in production might use different approach
xls = pd.ExcelFile('tyb2122.xlsx')

# Read sheets into a dictionary of sheets
excel_map = pd.read_excel(xls, sheet_name=None)
#print(excel_map.keys())

In [3]:
# Copy into a dict just because of naming below. No real need to do this
df_dict = excel_map

In [4]:
#print(df_dict['May 21'])

In [5]:
# Create a list of sheets to ignore
# Iterate over the sheets in the dict created above (misnamed stuff when starting out is all)
# Exclude the sheet if it's in the list
# Do some DQ analysis
# Otherwise - Group the data in the current sheet. Convert in-line to a dataframe
# Concatenate these as we go along
# Group the final sheet up to category level as it is the complete set

exclude_sheets = ['Template', 'Lists']

month_totals_df= pd.DataFrame()
totals_df= pd.DataFrame()

for k in df_dict.keys():
    #print(k)
    if k in exclude_sheets:
        #print("Excluded")
        continue
    else:
        
        # Check actuals column for nulls:
        check_nan = df_dict[k]['Actual'].isnull().values.any()
        if check_nan:
            print(f'Null Actuals in sheet: {k}')
        try:
            current_month_df = pd.DataFrame(df_dict[k].groupby('Category')['Actual'].sum())
        except:
            print(f'Error grouping: {k}')
        #Add current month to new dataframe
        current_month_df['month'] = k
        #display(current_month_df.head(10))
        #display(totals_df)
        month_totals_df = pd.concat([month_totals_df, current_month_df], axis=0) #, ignore_index=False)

# Group the months
totals_df = pd.DataFrame(month_totals_df.groupby('Category')['Actual'].sum()).reset_index()
#print(totals_df)
rental_categories = ['Airbnb', 'Cottages', 'Private']

In [6]:
# Output to csv
month_totals_df.to_csv('categories_all_months.csv')

totals_df.to_csv('category_totals.csv')

In [7]:
print(totals_df.head(10))

      Category    Actual
0  Advertising    -60.00
1       Airbnb  14888.25
2    Broadband   -327.98
3     Cottages   3700.52
4  Council Tax      0.00
5  Electricity  -2066.96
6  Furnishings  -2015.35
7    Household   -523.58
8    Insurance   -287.79
9      Laundry  -1492.70

april_df = df['April 21']
print(april_df.head(5))
april_df.columns = ['Date', 'Category', 'Detail', 'In / Out', 'Amount', 'Actual', 'Notes',
       'Unnamed: 7', 'Unnamed: 8']
print(april_df.head(5))

In [8]:
march_df = df_dict['March 22']

In [9]:
month_df = df_dict['May 21']
#display(month_df)
per_month_actuals = month_df.groupby('Category')['Actual'].sum()
per_month_actuals.head(100)

Category
Airbnb         1229.10
Broadband       -27.68
Cottages        905.24
Council Tax       0.00
Electricity     -61.87
Furnishings    -138.07
Household       -24.20
Laundry        -241.20
Loan           -179.06
Maintenance     -62.41
Mortgage       -241.07
Private         423.75
TV Licence      -11.87
Water           -25.00
Welcome         -45.13
Name: Actual, dtype: float64

In [10]:
# TODO Per month

In [11]:
month_totals_df.loc['Maintenance']

             Actual         month
Category
Maintenance -114.34      March 22
Maintenance -255.43   February 22
Maintenance  -58.10    January 22
Maintenance   -5.71   December 21
Maintenance  -53.29   November 21
Maintenance  -24.99    October 21
Maintenance  -26.99  September 21
Maintenance -165.00     August 21
Maintenance  -48.37       July 21
Maintenance   -3.99       June 21
Maintenance  -62.41        May 21
Maintenance -153.99      April 21

In [12]:
# WHERE CLAUSE ?
# Per Category
#display(totals_df)
where_df = month_totals_df.where(month_totals_df['month']=='April 21')
display(where_df)

             Actual     month
Category
Airbnb          NaN       NaN
Broadband       NaN       NaN
Council Tax     NaN       NaN
Electricity     NaN       NaN
Furnishings     NaN       NaN
...             ...       ...
Mortgage    -241.07  April 21
Private      352.50  April 21
TV Licence   -13.37  April 21
Water        -25.00  April 21
Welcome      -41.42  April 21

[181 rows x 2 columns]